import 'package:yosria/models/azkar_models.dart';

const monagaIbnAtaAllah = Zikr(
    title: 'مناجاة سيدي ابن عطاء الله السكندري',
    notes: '''
مناجاةٌ سيدي ابنِ عطاءِ اللهِ السَّكَنْدَرِيِّ رضي الله عنه

تقراً الاثنين صباحًا جماعة بمسجد الأشراف
  ''',
    content: '''
1. إِلَهِي أَنَا الفَقِيرُ فِي غِنَايَ، فَكَيْفَ لَا أَكُونُ فَقِيرًا فِي فَقْرِي.
2. إِلَهِي أَنَا الْجَاهِلُ فِي عِلْمِي، فَكَيْفَ لَا أَكُونُ جَهُولًا فِي جَهْلِي.
3. إِلَهِي إِنَّ اخْتِلَافَ تَدْبِيرِكَ وَسُرْعَةَ حُلُولِ مَقادِيرِكَ مَنَعَا عِبَادَكَ الْعَارِفِينَ بِكَ عَنِ السُّكُونِ إِلَى عَطَاءٍ، وَالْيَأْسِ مِنْكَ فِي بَلَاءٍ.
4. إِلَهِي مِنِّي ما يَلِيقُ بِلُؤْمِي، وَمِنْكَ مَا يَلِيقُ بِكَرَمِكَ.
5. إِلَهِي وَصَفْتَ نَفْسَكَ بِاللُّطْفِ وَالرَّأْفَةِ بِي قَبْلَ وُجُودِ ضَعْفِي، أَفَتَمْنَعُنِي مِنْهُمَا بَعْدَ وُجُودِ ضَعْفِي؟!
6. إِلَهِي إِنْ ظَهَرَتِ الْمَحَاسِنُ مِنِّي فَبِفَضْلِكَ وَلَكَ المِنَّةُ عَلَيَّ، وَإِنْ ظَهَرَتِ المَسَاوِي مِنِّي فَبِعَدْلِكَ وَلَكَ الحُجَّةُ عَلَيَّ.
7. إِلهِي كَيْفَ تَكِلُنِي إِلَى نَفْسِي، وَقَد تَّوَكَّلْتَ لِي، وَكَيْفَ أُضَامُ وَأَنْتَ النَّاصِرُ لِي، أَمْ كَيْفَ أَخِيبُ وَأَنْتَ الْحَفِيُّ بِي، هَا أَنَا أَتَوَسَّلُ إِلَيْكَ بِفَقْرِي إِلَيْكَ، وَكَيْفَ أَتَوَسَّلُ إِلَيْكَ بِما هُوَ مَحَالٌ أَنْ يَصِلَ إِلَيْكَ، أَمْ كَيْفَ أَشْكُو إِلَيْكَ حَالِي وَهُوَ لَا يَخْفَى عَلَيْكَ، أَمْ كَيْفَ أُتَرْجِمُ لَكَ بِمَقَالِي وَهُوَ مِنْكَ بَرَزَ إِلَيْكَ، أَمْ كَيْفَ تُخَيِّبُ آمَالِي وَهِيَ قَدْ وَفَدَتْ إِلَيْكَ، أَمْ كَيْفَ لا تُحْسِنُ أَحْوَالِي وَبِكَ قَامَتْ إِلَيْكَ؟!
8. إِلَهِي مَا أَلْطَفَكَ بِي مَعَ عَظِيمِ جَهْلِي، وَما أَرْحَمَكَ بِي مَعَ قَبِيحِ فِعْلِي.
9. إِلهِي مَا أَقْرَبَكَ مِنِّي، وَمَا أَبْعَدَنِي عَنْكَ.
10. إِلَهِي مَا أَرْأَفَكَ بِي، فَمَا الَّذِي يَحْجُبُنِي عَنْكَ؟!.
11. إِلَهِي قَدْ عَلِمْتُ بِاخْتِلَافِ الْآثارِ وَتَنَقُّلَاتِ الْأَطْوَارِ أَنَّ مُرَادَكَ مِنِّي أَنْ تَتَعَرَّفَ إِلَيَّ فِي كُلِّ شَيْءٍ حَتَّى لَا أَجْهَلَكَ فِي شَيْءٍ.
12. إِلَهِي كُلَّمَا أَخْرَسَنِي لُؤْمِي أَنْطَقَنِي كَرَمُكَ، وَكُلَّمَا آيَسَتْنِي أَوْصَافِي أَطْمَعَتْنِي مِنَّتُكَ.
13. إِلَهِي مَنْ كَانَتْ مَحَاسِنُهُ مَسَاوِيَ فَكَيْفَ لا تَكُونُ مَساوِيه مَساوِيَ، وَمَنْ كَانَتْ حَقائِقُهُ دَعَاوِيَ فَكَيْفَ لَا تَكُونُ دَعَاوِيه دَعَاوِيَ.
14. إِلَهِي حُكْمُكَ النَّافِذُ وَمَشِيئَتُكَ الْقَاهِرَةُ لَمْ يَتْرُكَا لِذِي مَقَالٍ مَقَالًا، وَلَا لِذِي حَالٍ حَالًا.
15. إِلَهِي كَمْ مِنْ طَاعَةٍ بَنَيْتُهَا وَحَالَةٍ شَيَّدتُّهَا هَدَمَ اعْتِمَادِي عَلَيْهَا عَدْلُكَ؛ بَلْ أَقَالَنِي مِنْهَا فَضْلُكَ.
16. إِلَهِي أَنْتَ تَعْلَمُ وَإِنْ لَمْ تَدُمِ الطَّاعَةُ مِنِّي فِعْلًا جَزْمًا فَقَدْ دَامَتْ مَحَبَّةً وَعَزْمًا.
17. إِلَهِي كَيْفَ أَعْزِمُ وَأَنْتَ الْقَاهِرُ، وَكَيْفَ لَا أَعْزِمُ وَأَنْتَ الْآمِرُ؟!.
18. إِلَهِي تَرَدُّدِي فِي الْآثَارِ يُوجِبُ بُعْدَ الْمَزارِ، فَاجْمَعْنِي عَلَيْكَ بِخِدْمَةٍ تُوَصِّلُنِي إِلَيْكَ.
19. إِلَهِي كَيْفَ يُسْتَدَلُّ عَلَيْكَ بِما هُوَ فِي وُجُودِهِ مُفْتَقِرٌ إِلَيْكَ، أَيَكُونُ لِغَيْرِكَ مِنَ الظُّهُورِ مَا لَيْسَ لَكَ حَتَّى يَكُونَ هُوَ المُظْهِرُ لَكَ؟!، مَتى غِبْتَ حَتَّى تَحْتاجَ إِلى دَلِيلٍ يَدُلُّ عَلَيْكَ، وَمَتى بَعُدتَّ حَتَّى تَكُونَ الْآثَارُ هِيَ الَّتِي تُوصِّلُ إِلَيْكَ، عَمِيَتْ عَيْنٌ لا تَراكَ عَلَيْها رَقِيبًا، وَخَسِرَتْ صَفْقَةُ عَبْدٍ لَمْ يَجْعَل لَّهُ مِنْ حُبِّكَ نَصِيبًا.
20. إِلَهِي أَمَرْتَ بِالرُّجُوعِ إِلَى الْآثَارِ، فَارْجِعْنِي إِلَيْهَا بِكِسْوَةِ الْأنْوَارِ وَهِدَايَةِ الاِسْتِبْصَارِ حَتَّى أَرْجِعَ إِلَيْكَ مِنْها كَما دَخَلْتُ إِلَيْكَ مِنْها مَصُونَ السِّرِّ عَنْ النَّظَرِ إِلَيْها، وَمَرْفُوعَ الهِمَّةِ عَنِ الاِعْتِمادِ عَلَيْها، إِنَّكَ عَلى كُلِّ شَيءٍ قَدِيرٌ.
21. إِلَهِي هَذَا ذُلِّي ظَاهِرٌ بَيْنَ يَدَيْكَ، وَهَذَا حَالِي لَا يَخْفَى عَلَيْكَ، مِنْكَ أَطْلُبُ الوُصُولَ إِلَيْكَ، وَبِكَ أَسْتَدِلُّ عَلَيْكَ لَا بِغَيْرك فَاهْدِنِي بِنُورِكَ إِلَيْكَ، وَأَقِمْنِي بِصِدْقِ العُبُودِيَّةِ بَيْنَ يَدَيْكَ.
22. إِلَهِي عَلِّمْنِي مِنْ عِلْمِكَ المَخْزُونِ، وَصُنِّي بِسِرِّ اسْمِكَ المَصُونِ.
23. إِلَهِي حَقِّقْنِي بِحَقَائِقِ أَهْلِ القُرْبِ، وَاسْلُكْ بِي مَسَالِكَ أَهْلِ الجَذْبِ.
24. إِلَهِي أَغْنِنِي بِتَدْبِيرِكَ لِي عَنْ تَدْبِيرِي، وَبِاخْتِيَارِكَ عَنْ اخْتِيارِي، وَأوْقِفْنِي عَلى مَراكِزِ اضطِّرارِي.
25. إِلَهِي أَخْرِجْنِي مِنْ ذُلِّ نَفْسِي وَطَهِّرْنِي مِنْ شَكِّي وَشِرْكِي قَبْلَ حُلُولِ رَمْسِي، بِكَ أَسْتَنْصِرُ فَانْصُرْنِي، وَعَلَيْكَ أَتَوَكَّلُ فَلَا تَكِلْنِي، وَإِيَّاكَ أَسْأَلُ فَلا تُخَيِّبْنِي، وَفِي فَضْلِكَ أَرْغَبُ فَلا تَحْرِمْنِي، وَلِجَنابِكَ أَنْتَسِبُ فَلا تُبْعِدْنِي، وَبِبَابِكَ أَقِفُ فَلا تَطْرُدْنِي.
26. إِلَهِي تَقَدَّسَ رِضَاكَ أَنْ تَكُونَ لَهُ عِلَّةٌ مِنْكَ، فَكَيْفَ تَكُونُ لَهُ عِلَّةٌ مِنِّي، أَنْتَ الغَنِيُّ بِذَاتِكَ عَنْ أَنْ يَصِلَ إِلَيْكَ النَّفْعُ، فَكَيْفَ لا تَكُونُ غَنِيًّا عَنِّي.
27. إِلَهِي إِنَّ القَضَا وَالقَدَرَ غَلَبَنِي، وَإِنَّ الهَوَى بِوَثَائِقِ الشَّهْوَةِ أَسَرَنِي، فَكُنْ أَنْتَ النَّاصِرُ لِي حَتَّى تَنْصُرَنِي وَتَنْصُرَ بِي، وَاغْنِنِي بِفَضْلِكَ حَتَّى أسْتَغْنِيَ بِكَ عَنْ طَلَبِي، أَنْتَ الَّذِي أَشْرَقْتَ الْأَنْوَارَ فِي قُلُوبِ أَوْلِيَائِكَ حَتَّى عَرَفُوكَ وَوَحَّدُوكَ، وَأَنْتَ الَّذِي أَزَلْتَ الأَغْيارَ عَنْ قُلُوبِ أَحْبَابِكَ حَتَّى لَمْ يُحِبُّوا سِوَاكَ وَلَمْ يَلْجَأَواْ إِلَى غَيْرِكَ، أَنْتَ المُؤْنِسُ لَهُمْ حَيْثُ أَوْحَشَتْهُمُ العَوالِمُ، وَأَنْتَ الَّذِي هَدَيْتَهُمْ حَتَّى اسْتَبانَتْ لَهُمْ المَعالِمُ. مَاذَا وَجَدَ مَنْ فَقَدَك؟!،َ وَمَا الَّذِي فَقَدَ مَنْ وَجَدَكَ؟!، لَقَدْ خَابَ مَنْ رَضِيَ دُونَكَ بَدَلًا، وَلَقَدْ خَسِرَ مَنْ بَغَى عَنْكَ مُتَحَوَّلًا.
28. إِلَهِي كَيْفَ يُرْجَى سِوَاكَ وَأَنْتَ مَا قَطَعْتَ الْإِحْسَانَ، وَكَيْفَ يُطْلَبُ مِنْ غَيْرِكَ وَأَنْتَ ما بَدَّلْتَ عادَةَ الاِمْتِنَانِ، يَا مَنْ أَذَاقَ أَحِبّاءَهُ حَلَاوَةَ مُؤَانَسَتِهِ فَقَامُواْ بَيْنَ يَدَيْهِ مُتَمَلِّقِينَ، وَيَا مَنْ أَلْبَسَ أَوْلِيَاءَهُ مَلَابِسَ هَيْبَتِهِ فَقَامُواْ بِعِزَّتِهِ مُسْتَعِزّينَ. أَنْتَ الذَّاكِرُ مِن قَبْلِ الذَّاكِرِينَ، وَأَنْتَ الْبَادِئُ بِالْإِحْسَانِ مِنْ قَبْلِ تَوَجُّهِ الْعَابِدِينَ، وَأَنْتَ الْجَوَادُ بِالعَطاءِ مِنْ قَبْلِ طَلَبِ الطَّالِبِينَ، وَأَنْتَ الْوَهَّابُ، ثُمَّ أَنْتَ لِمَا وَهَبْتَنَا مِنَ المُسْتَقْرِضِينَ.
29. إِلَهِي اطْلُبْنِي بِرَحْمَتِكَ حَتَّى أَصِلَ إِلَيْكَ، وَاجْذُبْنِي بِمَنَّتِكَ حَتَّى أُقْبِلَ عَلَيْكَ.
30. إِلَهِي إِنَّ رَجَائِي لَا يَنْقَطِعُ عَنْكَ وَإِنْ عَصَيْتُكَ، كَمَا أَنَّ خَوْفِي لا يُزايِلُنِي وَإِنْ أَطَعْتُكَ.
31. إِلَهِي قَدْ دَفَعَتْنِي العَوالِمُ إِلَيْكَ، وَقَدْ أَوْقَفَنِي عِلْمِي بِكَرَمِكَ عَلَيْكَ.
32. إِلَهِي كَيْفَ أَخِيبُ وَأَنْتَ أَمَلِي، أَمْ كَيْفَ أُهَانُ وَعَلَيْكَ مُتَّكَلِي.
33. إِلَهِي كَيْفَ أسْتَعِزُّ وَأَنْتَ فِي الذِّلَّةِ أَرْكَزْتَنِي، أَمْ كَيْفَ لا أَسْتَعِزُّ وَإِلَيْكَ نَسَبْتَنِي، أَمْ كَيْفَ لَا أَفْتَقِرُ وَأَنْتَ الَّذِي فِي الفَقْرِ أَقَمْتَنِي، أَمْ كَيْفَ أَفْتَقِرُ إِلَى غَيْرِكَ وَأَنْتَ الَّذِي بِجُودِكَ أَغْنَيْتَنِي، أَنْتَ الَّذِي لَا إِلهَ غَيْرُكَ، تَعَرَّفْتَ لِكُلِّ شَيءٍ فَمَا جَهِلَكَ شَيْءٌ، وَأَنْتَ الَّذِي تَعَرَّفْتَ إِلَيَّ فِي كُلِّ شَيْءٍ، فَرَأَيْتُكَ ظَاهِرًا فِي كُلِّ شَيْءٍ، فَأَنْتَ الظَّاهِرُ لِكُلِّ شَيْءٍ. يَا مَنْ اسْتَوَى بِرَحْمَانِيَّتِهِ عَلَى عَرْشِهِ، فَصَارَ الْعَرْشُ غَيْبًا فِي رَحْمَانِيَّتِهِ، كَمَا صَارَتِ الْعَوَالِمُ غَيْبًا فِي عَرْشِهِ، مَحَقْتَ الْآثَارَ بِالْآثَارِ، وَمَحَوْتَ الْأَغْيَارَ بِمُحِيطَاتِ أَفْلَاكِ الْأَنْوَارِ، يَا مَنْ احْتَجَبَ فِي سُرَادِقَاتِ عِزِّهِ عَنْ أَنْ تُدْرِكَهُ الأبْصارُ، يَا مَنْ تَجَلَّى بِكَمَالِ بَهَائِهِ فَتَحَقَّقَتْ عَظَمَتُهُ الْأَسْرَارَ، كَيْفَ تَخْفَى وَأَنْتَ الظَّاهِرُ، أَمْ كَيْفَ تَغِيبُ وَأَنْتَ الرَّقِيبُ الحاضِرُ؟!.
 
وَاللهُ الْمُوَفِّقُ 
﴿سُبۡحَٰنَ رَبِّكَ رَبِّ ٱلۡعِزَّةِ عَمَّا يَصِفُونَ۝١٨٠وَسَلَٰمٌ عَلَى ٱلۡمُرۡسَلِينَ۝١٨١وَٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ۝١٨٢﴾ [الصافات: 180-182].
''');

const adabAltareeqa = Zikr(
    title: 'آداب الطريقة اليسرية الصديقية',
    notes:
        'آداب الطريقة اليسرية الصديقية للسيد عبدالله الصديق الغماري رضي الله عنه',
    content: '''
## أدب المريد مع الله تعالى:
يلزمُ المريدُ من الأدبِ مع ربه أن يكون واقفًا مع حدود الشريعة غير مُعْتَدٍ لها، ولا متهاون فيها، وأن يكون مواظبًا على فعل السنن ونوافل الخيرات؛ فبذلك يحظى بحب مولاه ورضاه عنه جاء في حديث قدسي صحيح: «وَمَا تَقَرَّبَ إِلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إِلَيَّ مِمَّا افْتَرَضْتُ عَلَيْهِ، وَلاَ يَزَالُ عَبْدِي يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبْتُهُ كُنْتُ سَمْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطُشُ بِهَا وَرِجْلَهُ الَّتِي يَمْشِي بِهَا، وَلَئِنْ سَأَلَنِي لأُعْطِيَنَّهُ، وَلَئِنِ اسْتَعَاذَنِي لأُعِيذَنَّهُ».

وأن يكون راضيًا بما يُجْرِيهُ الله من تصاريف الأقدار قال عليه الصلاة والسلام في وصيته لابن عباسٍ رضي الله عنه : «وَاعْلَمْ أَنَّ مَا أَخْطَأَكَ لَمْ يَكُنْ لِيُصِيبَكَ، وَمَا أَصَابَكَ لَمْ يَكُنْ لِيُخْطِئَكَ»، ولا شك أن المريد إذا تحقق بهذا وَعَلِمَهُ اطمأنَّ قَلْبُهُ ورضي بما يصرفه في الكون رَبُّهُ.

وأن يتوجه بسؤاله إلى الله في كل شيء قال تعالى: ﴿وَسۡ‍َٔلُواْ ٱللَّهَ مِن فَضۡلِهِۦٓۚ﴾ [النساء: 32]، وقال عليه الصلاة والسلام : «إِذَا سَأَلْتَ فَاسْأَلِ اللهَ»، وفي حديثٍ آخر: «لِيَسْأَلْ أَحَدُكُمْ رَبَّهُ حَاجَتَهُ كُلَّهَا حَتَّى يَسْأَلَهُ شِسْعَ نَعْلِهِ إِذَا انْقَطَعَ»، وحصل لبعض السلف ضِيقٌ في معيشته حتى هَمَّ أن يطلبَ من بعض إخوانِهِ فرأى في منامه قائلًا يقول له: (أيحسن بالحر المريد إذا وجد عند الله ما يريد أن يميل بقلبه إلى العبيد) فاستيقظ وهو أغنى الناس قلبًا.

وأن يكون متأدبًا مع الرسول عليه الصلاة والسلام متخلقًا بسنته مُقَدِّمًا لها على كل شيء مُعَظِّمًا لأهل بيته وصحابته، وهذا لا يحتاج إلى برهان فقد نص الله تعالى في غير آيةٍ من القرآن على وجوب تعظيم رسوله والتأدب في حقه وجعل طاعتَهُ طاعةً لله، ونفى الإيمانَ عمن لم يرضَ بحكمِهِ، وتوعد من خالف أمره بالفتنة والعذاب الأليم."
## أدبُ المريدِ مع شيخهِ:
يلزم المريد من الأدب مع شيخه أن يُعَظِّمَهُ ويُوَقِّرَهُ، وألا يتقدم بين يديه بقولٍ أو فعلٍ، وأن يَذُبَّ عَنْهُ في غَيْبَتِهِ، وألَّا يحضر في مَجْلِسٍ يُنَالُ فيهِ مِنْ عِرْضِ شَيْخِهِ، وأن يستأذِنَهُ في الخروج إذا كان حَاضِرًا، وألا يخالف ما يشير به عليه الشيخ إلى غير ذلك مما لذكره محل آخر، وهذه الآداب استخرجها الصوفية مما أدّب الله به الصحابة في القرآن، وأمرهم أن يستعملوها مع النبي عليه الصلاة والسلام، ولا شك أن المشايخ خلفاؤُهُ في الإرشاد والتعليم والتهذيب كما قال عليه الصلاة والسلام: «الْعُلَمَاء وَرَثَة الأَنْبِياء» فتلزم هذه الآداب في حقهم بطريق الوراثة، ولهذا ينبغي ويتأكدُ في حق المريد قبل دخوله في الطريق أن يتخير الشيخَ الذي تتحقق فيه الوراثة النبوية، وذلك بأن يكون عالمًا بالشريعة متمكنًا فيها عالمًا بالقرآن والسنة؛ لأنه لا إرشادَ ولا سلوكَ إلا بما كان مطابقًا للشرع متمشيًا مع أحكامه ومن لم يكن متمكنًا في العلم متزينًا بالاستقامة لا يصلح للإرشاد؛ لأن فاقدَ الشيءِ لا يعطيه.
## أدبُ المريدِ معَ إخوانهِ:
يلزمُ المريدُ من الأدبِ مع إخوانه أن يحترمَهم ولا يرى لنفسه فضلًا عليهم، ويواسيَ محتاجَهُمْ، ويعودَ مريضَهم، ويُعلِّمَ جاهلَهم، ويتعاونَ معهم على إقامة شعائر الطريق، ويتغاضى عمن أخطأ منهم في حقه، ويلتمسَ له العذرَ في ذلك، ويحملَ حاله على محملٍ حَسَنٍ، ويخدمَهم بنفسهِ، وإذا قابل أحدًا منهم بدأه بالبِشْرِ والمصافحة، ومن زَلَّ منهم نصحه بالحسنى من غير أن يَحْتَقِرَهُ أو يشنعَ عليه، ويلزمه من الأدب مع المُقَدَّمِ أن يُعَظِّمَهُ ولا يتقدم عليه، ويسمعَ كلامَه ويعتبره نائبًا عن الشيخِ، وعلى المقدم أن يُعْنَى بمسائل الإخوان، ويتعاهَدَهُمْ بالمذاكرة المرة بعد المرة، ويَتَفَقَّدَ غائبَهُمْ ويلين لهم الجانب، وَيُسَوِّيَ بينهم في المعاملة.
## أدبُ المُرِيدِ معَ المسلمينَ:
يلزمه من الأدب معهم أن يعاملهم بالصدق ويتواضع معهم من غير أن يطمع في أحدٍ منهم، ولا يخافه ولا يخشاه، ويسعى في منفعتهم ويحب لهم من الخير ما يحب لنفسه؛ لقوله عليه الصلاة والسلام: «لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ»، فإذا حافظ المريد على هذه الآداب وواظب عليها كان مُوقِنًا صَادِقًا وَنَالَ منَ الله تعالى ما يبتغيهِ. وفقنا الله جميعًا لما فيه الخير والسداد، وأنالنا رضاه إنه جَوَادٌ كَرِيمٌ رَءُوفٌ رَحِيمٌ.
  '''
//   zikrList: [
//     Zikr(title: 'أدب المريد مع الله تعالى', content: '''
// يلزمُ المريدُ من الأدبِ مع ربه أن يكون واقفًا مع حدود الشريعة غير مُعْتَدٍ لها، ولا متهاون فيها، وأن يكون مواظبًا على فعل السنن ونوافل الخيرات؛ فبذلك يحظى بحب مولاه ورضاه عنه جاء في حديث قدسي صحيح: «وَمَا تَقَرَّبَ إِلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إِلَيَّ مِمَّا افْتَرَضْتُ عَلَيْهِ، وَلاَ يَزَالُ عَبْدِي يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبْتُهُ كُنْتُ سَمْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطُشُ بِهَا وَرِجْلَهُ الَّتِي يَمْشِي بِهَا، وَلَئِنْ سَأَلَنِي لأُعْطِيَنَّهُ، وَلَئِنِ اسْتَعَاذَنِي لأُعِيذَنَّهُ».
//
// وأن يكون راضيًا بما يُجْرِيهُ الله من تصاريف الأقدار قال عليه الصلاة والسلام في وصيته لابن عباسٍ رضي الله عنه : «وَاعْلَمْ أَنَّ مَا أَخْطَأَكَ لَمْ يَكُنْ لِيُصِيبَكَ، وَمَا أَصَابَكَ لَمْ يَكُنْ لِيُخْطِئَكَ»، ولا شك أن المريد إذا تحقق بهذا وَعَلِمَهُ اطمأنَّ قَلْبُهُ ورضي بما يصرفه في الكون رَبُّهُ.
//
// وأن يتوجه بسؤاله إلى الله في كل شيء قال تعالى: ﴿وَسۡ‍َٔلُواْ ٱللَّهَ مِن فَضۡلِهِۦٓۚ﴾ [النساء: 32]، وقال عليه الصلاة والسلام : «إِذَا سَأَلْتَ فَاسْأَلِ اللهَ»، وفي حديثٍ آخر: «لِيَسْأَلْ أَحَدُكُمْ رَبَّهُ حَاجَتَهُ كُلَّهَا حَتَّى يَسْأَلَهُ شِسْعَ نَعْلِهِ إِذَا انْقَطَعَ»، وحصل لبعض السلف ضِيقٌ في معيشته حتى هَمَّ أن يطلبَ من بعض إخوانِهِ فرأى في منامه قائلًا يقول له: (أيحسن بالحر المريد إذا وجد عند الله ما يريد أن يميل بقلبه إلى العبيد) فاستيقظ وهو أغنى الناس قلبًا.
//
// وأن يكون متأدبًا مع الرسول عليه الصلاة والسلام متخلقًا بسنته مُقَدِّمًا لها على كل شيء مُعَظِّمًا لأهل بيته وصحابته، وهذا لا يحتاج إلى برهان فقد نص الله تعالى في غير آيةٍ من القرآن على وجوب تعظيم رسوله والتأدب في حقه وجعل طاعتَهُ طاعةً لله، ونفى الإيمانَ عمن لم يرضَ بحكمِهِ، وتوعد من خالف أمره بالفتنة والعذاب الأليم."
// '''),
//     Zikr(title: 'أدبُ المريدِ مع شيخهِ', content: '''
// يلزم المريد من الأدب مع شيخه أن يُعَظِّمَهُ ويُوَقِّرَهُ، وألا يتقدم بين يديه بقولٍ أو فعلٍ، وأن يَذُبَّ عَنْهُ في غَيْبَتِهِ، وألَّا يحضر في مَجْلِسٍ يُنَالُ فيهِ مِنْ عِرْضِ شَيْخِهِ، وأن يستأذِنَهُ في الخروج إذا كان حَاضِرًا، وألا يخالف ما يشير به عليه الشيخ إلى غير ذلك مما لذكره محل آخر، وهذه الآداب استخرجها الصوفية مما أدّب الله به الصحابة في القرآن، وأمرهم أن يستعملوها مع النبي عليه الصلاة والسلام، ولا شك أن المشايخ خلفاؤُهُ في الإرشاد والتعليم والتهذيب كما قال عليه الصلاة والسلام: «الْعُلَمَاء وَرَثَة الأَنْبِياء» فتلزم هذه الآداب في حقهم بطريق الوراثة، ولهذا ينبغي ويتأكدُ في حق المريد قبل دخوله في الطريق أن يتخير الشيخَ الذي تتحقق فيه الوراثة النبوية، وذلك بأن يكون عالمًا بالشريعة متمكنًا فيها عالمًا بالقرآن والسنة؛ لأنه لا إرشادَ ولا سلوكَ إلا بما كان مطابقًا للشرع متمشيًا مع أحكامه ومن لم يكن متمكنًا في العلم متزينًا بالاستقامة لا يصلح للإرشاد؛ لأن فاقدَ الشيءِ لا يعطيه.
// '''),
//     Zikr(title: 'أدبُ المريدِ معَ إخوانهِ', content: '''
// يلزمُ المريدُ من الأدبِ مع إخوانه أن يحترمَهم ولا يرى لنفسه فضلًا عليهم، ويواسيَ محتاجَهُمْ، ويعودَ مريضَهم، ويُعلِّمَ جاهلَهم، ويتعاونَ معهم على إقامة شعائر الطريق، ويتغاضى عمن أخطأ منهم في حقه، ويلتمسَ له العذرَ في ذلك، ويحملَ حاله على محملٍ حَسَنٍ، ويخدمَهم بنفسهِ، وإذا قابل أحدًا منهم بدأه بالبِشْرِ والمصافحة، ومن زَلَّ منهم نصحه بالحسنى من غير أن يَحْتَقِرَهُ أو يشنعَ عليه، ويلزمه من الأدب مع المُقَدَّمِ أن يُعَظِّمَهُ ولا يتقدم عليه، ويسمعَ كلامَه ويعتبره نائبًا عن الشيخِ، وعلى المقدم أن يُعْنَى بمسائل الإخوان، ويتعاهَدَهُمْ بالمذاكرة المرة بعد المرة، ويَتَفَقَّدَ غائبَهُمْ ويلين لهم الجانب، وَيُسَوِّيَ بينهم في المعاملة.
// '''),
//     Zikr(title: 'أدبُ المُرِيدِ معَ المسلمينَ', content: '''
// يلزمه من الأدب معهم أن يعاملهم بالصدق ويتواضع معهم من غير أن يطمع في أحدٍ منهم، ولا يخافه ولا يخشاه، ويسعى في منفعتهم ويحب لهم من الخير ما يحب لنفسه؛ لقوله عليه الصلاة والسلام: «لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ»، فإذا حافظ المريد على هذه الآداب وواظب عليها كان مُوقِنًا صَادِقًا وَنَالَ منَ الله تعالى ما يبتغيهِ. وفقنا الله جميعًا لما فيه الخير والسداد، وأنالنا رضاه إنه جَوَادٌ كَرِيمٌ رَءُوفٌ رَحِيمٌ.
// ''')
//   ],
    );

const waseyaGamea = Zikr(
    title: 'وصية جامعة',
    notes:
        'وصية جامعة لجملة من الواجبات والآداب في رسالةٍ كتبها مولانا وإمامُنا ومُنْشِئُ طريقتِنا العارفُ الأكبرُ سيدي الشيخ السيد محمد بن الصديق لأهل مدينة العرائش بالمغرب الأقصى',
    content: '''
إلى إخواننا في الله وأحبائنا فيه كافة فقراء العرائش حفظكم الله وسلام عليكم ورحمة الله تعالى (أما بعد)

فَأُحِبُّكُمْ أَحَبَّكُمُ اللهُ ورَسُولُهُ أن تقومواْ بالوظائفِ الدينيةِ القلبية والقالبية ففيها السعادة الأخروية والراحة الأبدية، فمن الوظائف النطق بالشهادتين مع اعتقادِ معناها الذي هو ثبوت الوحدانية لله ذاتًا وصفةً وفعلاً وثبوت رسالة مولانا رسول الله × مع تصديقه فيما جاء به عن الله واتباع أوامره واجتناب نواهيه، فمنها وهو أهمها بعد الشهادتين أداء الصلوات الخمس في أوقاتها المُعَيَّنَةِ لها مع إيقاعها في الجماعة، والإتيان بجميع شروطها من الطهارة الكبرى والصغرى، واستقبال القبلة، وستر العورة، وإتقان الوضوء بإتقان الاستبراء الذي هو استفراغ ما في المحلين من الأذى مع الاستجمار بالحجارة إن أمكن، والغسل بالماء بعده، والإتيان بجميع الفرائض والسنن والمستحبات، ولابد مع هذا من المحافظة على النوافل كالوتر، والفجر، والرواتب القبلية والبعدية. ومنها الزكاة فأَدُّوهَا إن وجبت عليكم ولابد فإنها طهارة وبركة وسببٌ للغنى.

واحفظواْ مع هذا جوارحكم التي هي الأُذُنُ والعينُ واللسانُ والبطنُ واليدُ والفرجُ والرِّجْلُ من المنهيات فلا تسمعواْ إلا الوعظ والذكر والأمر بالمعروف والنهي عن المنكر ولا تنظروا إلى ما لا يحل لكم من النساء والصبيان والأمتعة.

واحفظوا ألسنتكم من الكَذِبِ، والغِيبَةِ، والنميمة، والزور والبهتان، وأَيْدِيَكُمْ من إذاية الناس في أبدانهم وأموالهم. وبُطُونَكُمْ من الحرام، وَفُرُوجَكُمْ من ممارسةِ ما لا يحلُّ لكم، وَأَرْجُلَكُمْ من المشي في غير طاعة الله، وَقُلُوبَكُمْ من العُجْبِ والْكِبْرِ والرِّيَاءِ والْحَسَدِ والْبُغْضِ والْغِلِّ والْحِقْدِ والْغِشِّ والْخَدِيعَةِ وَالْمُدَاهَنَةِ وَحُبِّ الرِّيَاسَةِ والتَّقَدُّمِ وَحُبِّ الْمَدْحِ وَخَوْفِ الذَّمِّ والاهْتِمَامِ بالرِّزْقِ والْخَوْفِ مِنَ الْخَلْقِ.

وَتَفَكُّرُواْ فِي مَصْنُوعَاتِ اللهِ، وَاسْتَحْضِرُواْ اطِّلَاعَهُ عَلَيْكُمْ في جميع الحالات، ولا تستعظمواْ هذا فإنه سهلٌ إن استعنتم عليه بالله، ثم المؤكد به عليكم الاجتماع لذكرِ اللهِ وقتَ فراغِكُمْ من الأشغال، وخصوصًا فيما بين المغرب والعشاء، وفيما بين صلاة الصبح وطلوع الشمس، ففي ذِكْرِ الله في هذين الوقتين من الفضل والثواب شيء عظيم.

وَتَزَاوَرُواْ في الله، وَتَحَابُّواْ فِيهِ وَوَاسُواْ مُحْتَاجَكُمْ، وصِلُواْ أَرْحَامَكُمْ، وَعُودُواْ مَرْضَاكُمْ، وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ، وَاحْتَمِلُواْ أَذَى مَنْ أَذَاكُمْ، وَلَا تُجَالِسُواْ مَنْ يَقْطَعُكُمْ عَنْ ذِكْرِ اللهِ، وَلَا تُخَالِطُوهُ فِإِنَّهُ يُمِيتُ قُلَوبَكُمْ وَفِي مَوْتِهَا فَسَـــادُ الدِّينِ وَضَعْفُ الْيَقِينِ، وَفِي ذِكْرِ اللهِ ذِكْرُهُ وَرِضَاهُ، وَمُجَالَسَتُهُ طُمَأْنِينَةُ الْقَلْبِ، وَفِي الاجْتِمَاعِ عَلَيْهِ رِيَاضُ الْجَنَّةِ وَغَشَيَانُ الرَّحْمَةِ وَنُزُولُ السَّكِينَةِ وَحُفُوفُ الْمَلَائِكَةِ حسبما وردتْ به الأخبارُ وَصَحَّتْ عَنْ رسولِ الله صلى الله عليه وسلم الآثارُ، وَإِيَّاكُمْ وَالْإِنْصَاتَ لِمَنْ يَصُدَّكُمْ أَوْ يَلُومَكُمْ فَإِنَّهُ شَيْطَانٌ مَارِدٌ وَمَطْرُودٌ شَارِدٌ.

وَلَا تُسِيئُواْ لِأَحَدٍ مِنْ عِبَادِ اللهِ، وَلَا تَخَافُوهُ وَلَا تَرْجُوهُ فَإِنَّ الأمورَ كُلَّهَا بِيَدِ اللهِ لَا يَمْلِكُ أَحَدٌ لِأَحَدٍ مِنْهَا ضَرًا وَلَا نَفْعًا وَلَا خَفْضًا وَلَا رَفْعًا وَصُونُواْ قُلُوبَكُمْ مِنَ الطَّمَعِ فِي الْخَلْقِ فَإِنَّهُ الْفَقْرُ الْحَاضِرُ والذُّلُّ الظَّاهِرُ، وَاعْلَمُواْ أَنَّكُمْ إِنْ فَعَلْتُمْ هَذَا ثَبَتَتْ خُصُوصَيَّتُكُمْ، وَنِلْتُمْ مَطْلُوبَكُمْ مِّن رَّبِّكُمْ، أَعَانَكُمُ اللهُ وَقَوَّاكُمْ، وَمِن نَّزَغَاتِ الشَّيْطَانِ حَفِظَكُمْ وَوَقَاكُمْ وَالسَّلَامُ.
''');

const sanadAltareeqa = Zikr(
    title: 'إسناد الطريقة اليسرية',
    notes: 'إسناد الطريقة اليسرية الصديقية الدرقاوية الشاذلية',
    content: '''
نقول: أخذتُ هذه الطريقةَ النبويةَ الشريفةَ أنا الفقيرُ إلى الله «يسري رشدي السيد جبر» عن:
1. سيدي أبي الفضل عبد الله بن محمد الصِّدِّيقِ الغُمَارِي (ت 1413هـ-1993م)، عن:
2. والده سيدي محمد بن الصِّدِّيقِ الغُمَارِي (ت 1354هـ-1936م)، عن:
3. سيدي محمد بن إبراهيم الفاسي (ت 1326هـ-1908م)، وهو أخذها عن:
4. شيخه سيدي عبد الواحد بُنَاني الفاسي (ت 1285هـ-1869م)، وهو عن:
5. شيخه سيدي محمد أيوب (ت 1273هـ-1856م) دفين زاويته بفاس، وهو أخذها عن:
6. الشريف سيدي الحاج أحمد بن عبد المؤمن الغماري (ت 1262-1846م)، وهو عن:
7. إمام الأولياء سيدنا ومولانا محمد العربي الدرقاوي (ت 1239هـ-1823م) دفين بني زَرْوَال، وهو عن:
8. بحر البحور أبي الحسن سيدي علي الجمل (ت 1194هـ-1780م) دفين زاويته بفاس، وهو أخذ عن:
9. سيدي محمد العربي (ت 1166هـ-1753م)، وهو أخذ عن:
10. والده سيدي أحمد بن عبد الله معن (ت 1120هـ-1708م)، وهو أخذ عن:
11. سيدي قاسم الخصاصي (ت 1083هـ-1673م)، وهو أخذ عن:
12. سيدي محمد فتح بن عبد الله المُكَنَّى مَعَنْ (ت 1062هـ-1652م)، وهو أخذ عن:
13. سيدي عبد الرحمن الفاسي (ت 1036هـ-1626م) مُحَشِّي «تفسير الجلالين»، و«صغرى السنوسي»، وهو أخذ عن:
14. أخيه القطب أبي المحاسن سيدي يوسف الفاسي (ت 1013هـ-1604م)، وهو عن:
15. القطب سيدي عبد الرحمن المجذوب (ت 976هـ-1569م)، وهو عن:
16. أبي الحسن سيدي علي الشهير بالدوار (ت 940هـ-1533م)، عن:
17. أبي إسحاق سيدي إبراهيم أَفْحَام الزَّرْهُونِي، عن:
18. القطب الجامع سيدي أحمد زَرُّوق (ت 879هـ-1474م) المدفون بسملاطة بطرابلس ليبيا، عن:
19. القطب أحمد بن عقبة الحضرمي (ت 895هـ-1490م) المدفون بتربة البرقوقة من القاهرة، عن:
20. أبي زكرياء يحيى بن أحمد بن محمد وفا القادري (ت 857هـ-1453م)، عن:
21. القطب سيدي علي بن محمد وفا (ت 807هـ-1405م)، عن:
22. والده القطب سيدي محمد بحر الصفا (ت 765هـ-1363م)، عن:
23. القطب سيدي داود الباخلي (ت 735هـ-1335م) دفين الإسكندرية، عن:
24. تاج الدين سيدي أحمد بن عطاء الله (ت 709هـ-1309م) صاحب «الحكم»، عن:
25. القطب أبي العباس أحمد بن عمر المرسي (ت 685هـ-1287م)، عن:
26. قطب الأقطاب سيدي أبي الحسن الشاذلي الغماري (ت 656هـ-1258م)، دفين حُمَيْثرة بصعيد مصر، عن:
27. القطب مولانا عبد السلام ابن بشيش، دفين جبل العلم بالمغرب الأقصى، عن:
28. القطب سيدي عبد الرحمن المدني ابن الحسين المشهور بالزيات، لسكناه بحارة الزياتين بالمدينة المنورة، عن:
29. القطب تُقَيْ الدين الفُقَيِّر -بالتصغير فيهما- عبد الرحمن النهروندي نسبة إلى نهروند من قرى واسط بالعراق، وهو عن:
30. القطب فخر الدين، عن:
31. القطب نور الدين أبي الحسن علي، عن:
32. القطب تاج الدين محمد بن القطب شمس الدين التركي، عن:
33. القطب زين الدين القزويني، عن:
34. القطب أبي إسحاق إبراهيم البصري، عن:
35. القطب أبي القاسم أحمد المرواني، عن:
36. القطب أبي محمد سعيد، عن:
37. القطب سعد، عن:
38. القطب أبي محمد فتح السعود، عن:
39. القطب سيدي سعيد الغزواني، عن:
40. القطب سيدي أبي محمد جابر بن عبد الله الأنصاري، عن:
41. أول الأقطاب، وأجل الأصحاب سيدنا الحسن ابن سيدتنا فاطمة الزهراء عن:
42. والده باب مدينة العلم مولانا عليّ كرَّم الله وجهه، عن:
43. سيد المرسلين وحبيب رب العالمين سيدنا محمدٍ صلى الله عليه وسلم عن الحق جل جلاله وتقدَّستْ أسماؤُهُ وصفاته.
''');

const asrGomaa = Zikr(
    title: 'ورد عصر يوم الجمعة',
    notes: 'يقرأ ما بين عصر الجمعة إلى مغربها',
    content: '''
اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ عَبْدِكَ وَنَبِيِّكَ وَرَسُولِكَ النَّبِي الأُمِّي) (80 مرة).
''');

// ويقرءون هذه الصيغة بغير عدد في أي وقت، وأقلها (3 مرات) وهي للشدائد: اللَّهُمَّ صلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ صَلاةً تُنَجِّينَا بِهَا مِنْ جَمِيعِ الأَهْوَالِ وَالآفَاتِ، وَتَقْضِي لَنَا بِهَا جَمِيعَ الحَاجَاتِ، وَتُطَهِّرُنَا بِهَا مِنْ جَمِيعِ السَّيِئَاتِ، وَتَرْفَعُنَا بِهَا أَعْلَى الدَّرَجَاتِ، وَتُبَلِغُنَا بِهَا أَقْصَى الغَايَاتِ مِنْ جَمِيعِ الخَيْرَاتِ فِي الحَيَاةِ وَبَعْدَ المَمَاتِ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلِّم. في الملمات والشدائد يقرءون بعدد (4444) الصلاة التازية الشهيرة بالنارية وهي للإمام التازي وصيغتها بالتلقي: اللَّهُمَّ صَلِّ صَلاةً كَامِلَةً وَسَلِّم سَلامًا تَامًّا عَلَى نَبِيٍّ تَنْحَلُّ بِهِ العُقَدُ، وَتَنْفَرِجُ بِهِ الكُرَبُ، وَتُقْضَى بِهِ الحَوَائِجُ، وَتُنَالُ بِهِ الرَّغَائِبُ وَحُسْنُ الخَوَاتِيْم، وَيُسْتَسْقَى الغَمَامُ بِوَجِهِه الكَرِيم. وتقسم على جميع الحاضرين. ومن الأسماء: (يا فتاح، يا رزاق).
//
// ويختم المريد بالفاتحة لروح مولانا القطب محمد بن الصديق ولشيخنا وقدوتنا الحجة ريحانة الزمان سيدي ومولاي الحافظ أبي الفضل عبد الله بن محمد بن الصديق نفعنا الله به وبمشايخه وآبائه وتلامذته ومريديه ومحبيه في الدارين آمين.

const hawatfAlhaqaeq = Zikr(title: 'هواتف الحقائق', notes: '''
هواتف الحقائق للإمام ابن عطاء الله السكندري في مناجاة الحق تبارك وتعالى لعبده المؤمن على ألسن هواتف الحقائق في شأن التدبير و الرزق

تقراً الاثنين صباحًا جماعة بمسجد الأشراف
  ''', footer: '''
[1]: ‎هم الذين عاينوا هذه الاحوال ورأو لطف الله وبدائع وده ؛ ومتع أسرارهم بشهود فضله وإفضاله ومنته ورحمته ورعايته.
[2]: ‎أي اخرج عا تريده لنفسك من حظوظ النفس والدنيا أبلغك عين المراد منك.
''', content: '''
1. أيها العبد: ألقِ سمعك وأنت شهيد؛ يأتك من الله المزيد، وأصغ بسمعك فأنا لست عنك ببعيد.

2. أيها العبد: كنت بتدبيري لك قبل أن تكون لنفسك، فكن لنفسك بألا تكون لها، وتوليت رعايتها قبل ظهورك وأنا الآن على الرعاية لها.

3. أيها العبد: أنَا المنفرد بالخلق والتصوير، وأنا المنفرد بالحكم والتدبير، لم تشاركني في خلقي وتصويري، فلا تشاركني في حكمي وتدبيري.

4. أيها العبد: أنا المدبِّرُ لملكي، وليس لي فيه ظهير، وأنا المنفرد بحكمي، ولا أحتاج إلى وزير.

5. أيها العبد: من كان لك بتدبيره قبل الإيجاد فلا تشاركه في المراد، ومن عَوَّدَكَ حسن النظر منه لك فلا تقابله بالعناد.

6. أيها العبد: عودْتُكَ حسنَ النظر مني لك، فعودني إسقاط التدبير منك معي، أشاكٌّ بعد وجود التجرِبة، وحَيْرَةٌ بعد وجود البيان، وضلالٌ بعد وضوح الهدى، وقد سلمت لي قيامي بمملكتي وأنت من مملكتي، فلا تنازع ربوبيتي، ولا تضادد بتدبيرك مع وجود إلهيتي.

7. أيها العبد: متى أحوجتك إليك حتى تحتال عليَّ! متى وكلت شيئًا من مملكتي لغيري حتى أكل ذلك إليك! متى خاب من كنت له مدبرًا! ومتى خذل من كنت له ناصرًا!.

8. أيها العبد: لتشغلك خدمتي عن طلب قسمتي، وليمنعك حسن الظن بي عن اتهام ربوبيتي، لا ينبغي أن يُتَّهَمَ محسن، ولا أن ينازع مقتدر، ولا أن يضاد قهار، ولا أن يعترض على حكيم، ولا أن يعال همٌّ مع لطيف.

9. أيها العبد: لقد فاز بالنجح من خرج عن الإرادة معي، ولقد ذل من احتال عليَّ، ولقد استوجب النصر مني عبدٌ إذا تحرك تحرك بي، ولقد استمسك بأقوى الأسباب من استمسك بسببي.

10. أيها العبد: نريد منك أن تريدنا ولا تريد معنا، ونريد منك أن تختارنا ولا تختار معنا، ونرضى لك أن ترضانا، ولا ترضى سوانا، وكما سلمت لي تدبيري في أرضي وسمائي، وانفرادي فيهما بحكمي وقضائي، سلم وجودك لي فإنك لي، ولا تدبر معي فإنك معي، واتخذني وكيلًا، وثِقْ بي كفيلًا أعطِكَ عطاءً جزيلًا، وأهبك فخرًا جليلًا.

11. أيها العبد: ويحك إنَّا أجللنا قدرك أن نشغلك بأمر نفسك، فلا تصغر قدرك يا من رفعناه، ولا تَذِلَّنَّ بحوالتك على غيرنا.

12. أيها العبد: يا من أعززناه ويحك أنت أجلُّ عندنا من أن نشغلك بغيرنا، لحضرتي خلقتك، وإليها خطبتك، وبجواذب عنايتي إليها جذبتك، فإن اشتغلت بنفسك حجبتك، وإن اتبعت هواها طردتك، وإن خرجت عنها قرَّبْتُكَ، وإن توددت إلي بإعراضك عَمَّنْ سواي أحببتك.

13. أيها العبد: ما آمن بي من نازعني، ولا وحَّدني من دبَّرَ معي، ولا رضي بي من شكا ما أنزلت به إلى غيري، ولا اختارني من اختار معي، ولا رضي ولا امتثل أمري من لم يستسلم لقهري.

14. أيها العبد: لو طلبت التدبير لنفسك لجهلت فكيف إذا دبرت لها؟! ولو اخترت معي ما أنصفت فكيف إذا اخترت عليَّ؟!.

15. أيها العبد: يكفيك من الجهل أن تسكن لما في يديك ولا تسكن لما في يدي، أنا أختار لك أن تختارني فتختار عليَّ.

16. أيها العبد: يا مهمومًا بنفسه، لو ألقيتها إلينا لاسترحت، ويحك أعباء التدبير لا تحملها إلا الربوبيَّةُ، وليس بقويٍّ عليها ضعيف البشرية.

17. أيها العبد: ويحك أنت محمول فلا تكن حاملًا! أردنا راحتك فلا تكن متبعًا لنفسك!.

18. أيها العبد: أمرتك بخدمتي وضمنت لك بقسمتي، فأهملتَ ما أمرت، وشككتَ فيما ضمنت، ولم أكتفِ لك بالضمان حتى أقسمت، ولم أكتفِ بالقسم حتى مثلت، فخاطبت عبادًا يفهمون: فقلت: ﴿وَفِي ٱلسَّمَآءِ رِزۡقُكُمۡ وَمَا تُوعَدُونَ۝٢٢فَوَرَبِّ ٱلسَّمَآءِ وَٱلۡأَرۡضِ إِنَّهُۥ لَحَقٌّ مِّثۡلَ مَآ أَنَّكُمۡ تَنطِقُونَ۝٢٣﴾[الذاريات: 22-23]، وقد رزقت من غفل عني وعصاني، فكيف لا أرزق من أطاعني ودعاني!

19. أيها العبد: ويحك! الغارس للشجرة ساقيها، والممدُّ للخليقة هو باريها، مني كان الإيجاد، وعليَّ دوام الإمداد، مني كان الخلق، وعليَّ دوام الرزق، أأدخلك داري وأمنعك إبراري! أنبرزك لكوني ونمنعك جُوْدَ عوني!

20. أيها العبد: أنخرجك إلى وجودي ونمنعك جودي، لك هيأت مِنَّتِي، وفيك أظهرتُ رَحْمَتِي، وما قنعتُ بالدنيا حتى ادَّخَرْتُ لك جنتي، وما اكتفيتُ لك بذلك حتى أتْحَفْتُكَ برُؤْيَتِي، وإذا كانت هَذِهِ أفعالي، فلا تَشُكَّ في أفضالي، تخيرْني ولا تختر عليَّ، ووجِّهْ قلبك بالصدق إليَّ، فإن فعلت أريتك غرائب لطفي، وبدائع جودي، وأمتع سرك بشهودي.

21. أيها العبد: لقد ظهرت الطريق لأهل التحقيق[^1]، وتبينت معالم الهدي لذوي التوفيق؛ فبحقٍّ سَلَّم إليَّ الموفقون، وبتبيان توكَّلَ عليَّ المتوكلون، علموا أني خير لهم من أنفسهم، وأن تدبيري لهم أحرى من تدبيرهم لها، فأذْعَنُوا لربوبيتي مستسلمين، وطرحوا أنفسهم بين يَدَيَّ مفوِّضِينَ، فعَوَّضْتُهُم عوض ذلك راحة في نفوسهم، ونورًا في عقولهم، ومعرفة في قلوبهم، وتحقيقًا بقربي في أسرارهم. هذا في هذه الدار، ولهم عندي إذا قدموا عليَّ أن أجلَّ منصبهم، وأعلي مَحَلَّهُمْ، ولهم عليَّ إذا أدخلتهم داري ما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر.

22. أيها العبد: الوقت الذي أنت تستقبله لم أطالبك فيه بالخدمة، فلا تطالبني فيه بالقسمة، فإذا كلفتك تكفلت لك، فإذا استخدمتك أطعمتك، واعلم بأني لا أنساك وإن نسيتني، وإني ذكرتك قبل أن تذكرني، وأن رزقي عليك دائم وإن عصيتني، فإذا كنت لك كذلك في إعراضك عني، فكيف تَرَى أن أكون لك في إقبالك علي.

23. أيها العبد: ما قدرتني حَقَّ قدري إن لم تَسْتَسْلِمْ لقَهْرِي، ولا رعيت حقَّ بِرِّي إن لم تمتثل أمري، فلا تُعْرِضْ عني فإنَّك لا تجد من تستبدله مني، لا تغتر بغيري فإن أحدًا لا يغنيك عنِّي.

24. أيها العبد: أنَا الخالق لك بقدرتي، وأنا الباسط لك منَّتِي، فكما أنه لا خالق لك غيري، فكذلك لا رازق غيري.

25. أيها العبد: أخلق وأحيل علي غيري وأنا المتفضل! أمنع العباد وجود خيري وأنا المنعم! فثِقْ أيُّهَا العبد فأنا ربُّ العباد، واخرج من مرادك لي[^2] أبلغك عين المراد، واذكر سوابِقَ لطفي ولا تنس حقَّ الودادِ.
''');
